[
  {
    "title": "Sgt. Pepper's Lonely Hearts Club Band",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-sgt-peppers-lonely-hearts-club-band-20120531",
    "cover": "http://assets.rollingstone.com/assets/images/list/8f5a817710d65dcedfe55ca22a7d79c2e7259e6c.JPG",
    "artist": "The Beatles",
    "rank": 1,
    "label": "Capitol",
    "year": 1967,
    "summary": "Sgt. Pepper's Lonely Hearts Club Band is the most important rock & roll album ever made, an unsurpassed adventure in concept, sound, songwriting, cover art and studio technology by the greatest rock & roll group of all time. From the title song's regal blasts of brass and fuzz guitar to the orchestral seizure and long, dying piano chord at the end of \"A Day in the Life,\" the 13 tracks on Sgt. Pepper's Lonely Hearts Club Band are the pinnacle of the Beatles' eight years as recording artists. John Lennon, Paul McCartney, George Harrison and Ringo Starr were never more fearless and unified in their pursuit of magic and transcendence."
  },
  {
    "title": "Pet Sounds",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beach-boys-pet-sounds-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/eafbc592120358b4d3d14cda5acebf62ae50a522.JPG",
    "artist": "The Beach Boys",
    "rank": 2,
    "label": "Capitol",
    "year": 1966,
    "summary": "\"Who's gonna hear this shit?\" Beach Boys singer Mike Love asked the band's resident genius, Brian Wilson, in 1966, as Wilson played him the new songs he was working on. \"The ears of a dog?\" But Love's contempt proved oddly useful: \"Ironically,\" Wilson observed, \"Mike's barb inspired the album's title.\" Barking dogs - Wilson's dog Banana among them, in fact - are prominent among the found sounds on the album. The Beatles made a point of echoing them on Sgt. Pepper's Lonely Hearts Club Band - an acknowledgment that Pet Sounds was the inspiration for the Beatles' masterpiece. That gesture actually completed a circle of influence: Wilson initially  conceived of Pet Sounds as an effort to top the Beatles' Rubber Soul."
  },
  {
    "title": "Revolver",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-revolver-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/daa031ec00ad83a2da305fe583d746d030fa46ca.JPG",
    "artist": "The Beatles",
    "rank": 3,
    "label": "Capitol",
    "year": 1966,
    "summary": "\"I don't see too much difference between Revolver and Rubber Soul,\" George Harrison once said. \"To me, they could be Volume One and Volume Two.\" Revolver extends the more adventurous aspects of its predecessor - its introspection, its nascent psychedelia, its fascination with studio artistry - into a dramatic statement of generational possibility."
  },
  {
    "title": "Highway 61 Revisited",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-dylan-highway-61-revisited-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/3dbec55509cc2ca2776a37e27102718700790947.JPG",
    "artist": "Bob Dylan",
    "rank": 4,
    "label": "Columbia",
    "year": 1965,
    "summary": "Bruce Springsteen described the beginning of \"Like a Rolling Stone,\" the opening song on Highway 61 Revisited, as the \"snare shot that sounded like somebody'd kicked open the door to your mind.\" Folk singer Phil Ochs was even more rhapsodic about the LP: \"It's impossibly good... How can a human mind do this?\""
  },
  {
    "title": "Rubber Soul",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-rubber-soul-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/6a2b508760f8dfca2260822c63640baa769795b4.JPG",
    "artist": "The Beatles",
    "rank": 5,
    "label": "Capitol",
    "year": 1965,
    "summary": "In 1965, radios were abuzz with such groundbreaking singles as \"(I Can't Get No) Satisfaction\" and \"Like a Rolling Stone.\" That December, the Beatles met their peers' challenge head-on with Rubber Soul, a stunning collection that preserved the taut pop focus of the band's earlier LPs while introducing newfound sophistication and depth. Producer George Martin described Rubber Soul as \"the first album to present a new, growing Beatles to the world,\" and so it was."
  },
  {
    "title": "What's Going On",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/marvin-gaye-whats-going-on-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/89f4e4079e43af44a80043f496eebfc562e3c9ec.JPG",
    "artist": "Marvin Gaye",
    "rank": 6,
    "label": "Motown",
    "year": 1971,
    "summary": "\"In 1969 or 1970, I began to re-evaluate my whole concept of what I wanted my music to say,\" Marvin Gaye said. \"I was very much affected by letters my brother was sending me from Vietnam, as well as the social situation here at home. I realized that I had to put my own fantasies behind me if I wanted to write songs that would reach the souls of people. I wanted them to take a look at what was happening in the world.\" The masterpiece that followed Gaye's awakening revolutionized black music. From its rich, string-suffused grooves to its boundless sense of possibility, What's Going On is the Sgt. Pepper of soul."
  },
  {
    "title": "Exile on Main Street",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-rolling-stones-exile-on-main-street-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/a79e314b8bb4a44886afc91cf2db9b0e6f4a1526.JPG",
    "artist": "The Rolling Stones",
    "rank": 7,
    "label": "Rolling Stones Records",
    "year": 1972,
    "summary": "A dirty whirl of blues and boogie, the Rolling Stones' 1972 double LP \"was the first grunge record,\" guitarist Keith Richards crowed proudly in a 2002 interview. But inside the deliberately dense squall - Richards'  and Mick Taylor's dogfight riffing, the lusty jump of the Bill Wyman-Charlie Watts rhythm engine, Mick Jagger's caged-animal bark and burned-soul croon - is the Stones' greatest album and Jagger and Richards' definitive songwriting statement of outlaw pride and dedication to grit. In the existential shuffle \"Tumbling Dice,\" the exhausted country beauty \"Torn and Frayed\" and the whiskey-soaked uplift of \"Shine a Light,\" you literally hear the Stones in exile: working at Richards' villa in the South of France, and on the run from media censure, British drug police (Jagger and Richards already knew the view from behind bars) and the country's onerous tax code. Exile is rife with allusions to their outsider status: The album's cover is a collage of freakish American characters, and on \"Sweet Black Angel\" they toast imprisoned activist Angela Davis - one set of renegades to another. The music rattles like battle but also swings with clear purpose on songs like \"Rocks Off\" and \"All Down the Line.\" As Richards explained, \"The Stones don't have a home anymore - hence the Exile - but they can still keep it together. Whatever people throw at us, we can still duck, improvise, overcome.\" Great example: Richards recorded his jubilant romp \"Happy\" with just producer Jimmy Miller on drums and saxman Bobby Keys - while waiting for the other Stones to turn up for work. Exile on Main Street is the Stones at their fighting best, armed with the blues, playing to win."
  },
  {
    "title": "London Calling",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-clash-london-calling-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/692d99af3ab2207de3a7757ad3eb2fc65644ed49.JPG",
    "artist": "The Clash",
    "rank": 8,
    "label": "Epic",
    "year": 1980,
    "summary": "Recorded in 1979 in London, which was then wrenched by surging unemployment and drug addiction, and released in America in January 1980, the dawn of an uncertain decade, London Calling is 19 songs of apocalypse, fueled by an unbending faith in rock & roll to beat back the darkness. Produced with no-surrender energy by legendary Seventies studio madman Guy Stevens, the Clash's third album skids from bleak punk (\"London Calling\") to rampaging ska (\"Wrong 'Em Boyo\") and disco resignation (\"Lost in the Supermarket\"). The album was made in dire straits too. The band was heavily in debt and openly at war with its record company. Singer-guitarists Joe Strummer and Mick Jones wrote together in Jones' grandmother's flat. \"Joe, once he learned how to type, would bang the lyrics out,\" Jones said. \"Then I'd be able to bang out some music while he was hitting the typewriter.\" Strummer, Jones, bassist Paul Simonon and drummer Topper Headon spent nearly three months rehearsing and demoing songs in a garage in the Pimlico section of London - \"with one light and filthy carpet on the walls for soundproofing,\" recalled Strummer in 1989. \"We felt that we were struggling,\" he said, \"about to slide down a slope or something, grasping with our fingernails.\" But Stevens was on hand for inspiration. He threw chairs around the room \"if he thought a track needed zapping up,\" according to Strummer. The album ends with \"Train in Vain,\" a rousing song of fidelity (unlisted on the back cover because it was added at the last minute) that became the sound of triumph: the Clash's first Top 30 single in the U.S."
  },
  {
    "title": "Blonde on Blonde",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-dylan-blonde-on-blonde-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c659072c7a5fd09b178fc73b1cc6c03bc9c5763b.JPG",
    "artist": "Bob Dylan",
    "rank": 9,
    "label": "Columbia",
    "year": 1966,
    "summary": "Released on May 16th, 1966, rock's first studio double LP by a major artist was, as Dylan declared in 1978, \"the closest I ever got to the sound I hear in my mind... that thin, that wild-mercury sound.\" There is no better description of the album's manic brilliance. After several false-start sessions in New York in the fall of 1965 and January 1966 with his killer road band the Hawks - \"One of Us Must Know (Sooner or Later)\" was the only keeper - Dylan blazed through the rest of Blonde on Blonde's 14 tracks in one four-day run and one three-day run at Columbia's Nashville studios in February and March 1966."
  },
  {
    "title": "The White Album",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-the-white-album-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c851b340c6dccdeafaeb8d147ea084cba2e06236.JPG",
    "artist": "The Beatles",
    "rank": 10,
    "label": "Capitol",
    "year": 1968,
    "summary": "They wrote the songs while on retreat with the Maharishi Mahesh Yogi in India, taking a break from the celebrity whirl. As John Lennon later said, \"We sat in the mountains eating lousy vegetarian food and writing all these songs.\" They came back with more great tunes than they could fit on a single LP, and competed fiercely during the sessions. \"I remember having three studios operating at the same time,\" George Harrison recalled. \"Paul was doing some overdubs in one, John was in another, and I was recording some horns or something in a third.\" The sessions became so tense that Ringo Starr quit the band in frustration for two weeks. Yet the creative tension resulted in one of the most intense and adventurous rock albums ever made. Lennon pursued his hard-edged vision into the cynical wit of \"Sexy Sadie\" and \"Happiness Is a Warm Gun,\" but also infused \"Julia\" and \"Dear Prudence\" with childlike yearning. Paul McCartney's playful pop energy came through on his inversion of Chuck Berry's American values, \"Back in the U.S.S.R.,\" and he showed off his raucous side in \"Helter Skelter.\" Harrison's spiritual yearning led him to \"Long, Long, Long\" and \"While My Guitar Gently Weeps,\" featuring a guest guitar solo from Eric Clapton. Even Starr contributed his first original, the country-tinged \"Don't Pass Me By.\" \"I think it was a very good album,\" said McCartney. \"It stood up, but it wasn't a pleasant one to make.\""
  },
  {
    "title": "The Sun Sessions",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/elvis-presley-the-sun-sessions-20120530",
    "cover": "http://assets.rollingstone.com/assets/images/list/7a33165e92d530dd0f7c190f9dd46f81b95c5913.JPG",
    "artist": "Elvis Presley",
    "rank": 11,
    "label": "RCA",
    "year": 1999,
    "summary": "Many believe rock & roll was born on July 5th, 1954, at Sun Studio in Memphis. Elvis Presley, guitarist Scotty Moore and bassist Bill Black were horsing around with \"That's All Right, Mama,\" a tune by bluesman Arthur \"Big Boy\" Crudup, when producer Sam Phillips stopped them and asked, \"What are you doing?\" \"We don't know,\" they said. Phillips told them to \"back up and do it again.\" The A side of Presley's first single (backed with a version of Bill Monroe's \"Blue Moon of Kentucky\"), \"That's All Right\" was issued by Sun on July 19th. It may or may not be the first rock & roll record. But the man who would be King was officially on wax. Bridging black and white, country and blues, his sound was playful and revolutionary, charged by a spontaneity and freedom that changed the world. \"It's the blues,\" critic Greil Marcus wrote in his classic book Mystery Train. \"But free of all worry, all sin; a simple joy with no price to pay.\" Presley released four more singles on Sun - including definitive reinventions of Wynonie Harris' \"Good Rockin' Tonight\" and Junior Parker's \"Mystery Train\" - before moving on to immortality when Phillips sold his contract to RCA for $35,000. Incredibly, it took more than 20 years for Presley's Sun output to be properly collected on a 1976 LP - which has since been superseded by this 1999 double-CD chronicle of the King's beginnings at Sun. It collects everything he cut at the studio, including alternate takes and the 1953 acetate he recorded as a gift for his mother as a shy and awkward recent high school graduate."
  },
  {
    "title": "Kind of Blue",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/miles-davis-kind-of-blue-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/7d7508478e8e401003325d5d0aaac731560d13ab.JPG",
    "artist": "Miles Davis",
    "rank": 12,
    "label": "Columbia",
    "year": 1959,
    "summary": "This painterly masterpiece would become one of the most important, influential and popular albums in jazz. But at the time it was made, Kind of Blue was a revolution all its own, a radical break from everything going on. Turning his back on standard chord progressions, trumpeter Miles Davis used modal scales as a starting point for composition and improvisation - breaking new ground with warmth, subtlety and understatement in the thick of hard bop. Davis and his peerless band - bassist Paul Chambers, drummer Jimmy Cobb, pianist Bill Evans, and the titanic sax team of John Coltrane and Cannonball Adderley - soloed in uncluttered settings, typified by \"melodic rather than harmonic variation,\" as Davis put it. Two numbers, \"All Blues\" and \"Freddie Freeloader\" (the latter featured Wynton Kelly at the ivories in place of Evans), were in 12-bar form, but Davis' approach allowed his players a cool, new, collected freedom. Evans wrote in his original liner notes, \"Miles conceived these settings only hours before the recording dates and arrived with sketches which indicated to the group what was to be played. Therefore, you will hear something close to pure spontaneity in these performances.\" Or as the late critic Robert Palmer wrote, \"Kind of Blue is, in a sense, all melody - and atmosphere.\" The bass line in \"So What\" is now among the most familiar obbligatos in jazz, and there is no finer evocation of the late-night wonder of jazz than the muted horns in \"All Blues.\""
  },
  {
    "title": "The Velvet Underground",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-velvet-underground-and-nico-the-velvet-underground-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/99e8a590fe492cdd130f7debb20f934748fbc4b7.JPG",
    "artist": "The Velvet Underground and Nico",
    "rank": 13,
    "label": "Verve",
    "year": 1967,
    "summary": "\"We were trying to do a Phil Spector thing with as few instruments as possible,\" John Cale, the classically trained pianist and viola player of the Velvet Underground, said of this record. It was no idle boast. Much of what we take for granted in rock would not exist without this New York band or its seminal debut: the androgynous sexuality of glitter; punk's raw noir; the blackened-riff howl of grunge and noise rock; goth's imperious gloom. Recorded dirt-cheap at a studio that was literally falling apart, it is a record of fearless breadth and lyric depth. Singer-songwriter Lou Reed documented carnal desire and drug addiction, decadence and redemption, with a pop wisdom he learned as a song-factory composer for Pickwick Records. Cale introduced the power of pulse and drone (from his work with minimalist composer La Monte Young); guitarist Sterling Morrison and drummer Maureen Tucker played with tribal force; Nico, a German vocalist added to the band by manager Andy Warhol, brought an icy femininity to the heated ennui in Reed's songs. Rejected as nihilistic by the love crowd in '67, the Banana Album (so named for its Warhol-designed cover) is the most prophetic rock album ever made."
  },
  {
    "title": "Abbey Road",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-abbey-road-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/0921fbfa76c66953268f4bdeee9410ef7ef02536.JPG",
    "artist": "The Beatles",
    "rank": 14,
    "label": "Capitol",
    "year": 1969,
    "summary": "\"It was a very happy record,\" said producer George Martin. \"I guess it was happy because everybody thought it was going to be the last.\" Abbey Road - recorded mostly in two months during the summer of 1969 - almost never got made at all. That January, the Beatles were on the verge of a breakup, exhausted and angry with one another after the disastrous sessions for the aborted Get Back LP, later salvaged as Let It Be [see No. 392]. Determined to go out with a sense of recaptured glory, the group reconvened at EMI's Abbey Road Studios to make its most polished album: a collection of superb songs cut with an attention to refined detail, then segued together (especially on Side Two) with conceptual force. There was no thematic link, other than the Beatles' unique genius. John Lennon veered from the stormy metal of \"I Want You (She's So Heavy)\" to the exquisite vocal sunrise of \"Because.\" Paul McCartney was saucy (\"Oh! Darling\"), silly (\"Maxwell's Silver Hammer\") and deliciously bitter (\"You Never Give Me Your Money\"). George Harrison proved his long-secret worth as a composer with \"Something\" and the folk-pop diamond \"Here Comes the Sun,\" written in his friend Eric Clapton's garden while playing hooky from a business meeting. And Lennon, McCartney and Harrison reputedly sang more three-part harmony here than on any other Beatles album. Let It Be was the group's final release, but this album was its real goodbye."
  },
  {
    "title": "Are You Experienced?",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-jimi-hendrix-experience-are-you-experienced-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/5c60b6f07182074469636bb45da1fd26b8d2a04f.JPG",
    "artist": "The Jimi Hendrix Experience",
    "rank": 15,
    "label": "Reprise",
    "year": 1967,
    "summary": "This is what Britain sounded like in late 1966 and early 1967: ablaze with rainbow blues, orchestral guitar feedback and the personal cosmic vision of black American émigré Jimi Hendrix. Rescued from dead-end gigs in New York by ex-Animal Chas Chandler, Hendrix arrived in London in September 1966, quickly formed the Experience with bassist Noel Redding and drummer Mitch Mitchell and in a matter of weeks was recording the songs that comprised his epochal debut - which stands four and a half decades later as rock's most innovative and expressive guitar record. Hendrix's incendiary playing was historic in itself, the luminescent sum of his chitlin-circuit labors in the early Sixties with Little Richard and the Isley Brothers and his melodic exploitation of amp howl. But it was the pictorial heat of songs like \"Manic Depression,\" \"I Don't Live Today\" and \"The Wind Cries Mary\" that established the transcendent promise of psychedelia. Hendrix made soul music for inner space. \"It's a collection of free feeling and imagination,\" he said of the album. \"Imagination is very important.\" Widely assumed to be about an acid trip, \"Purple Haze\" had \"nothing to do with drugs,\" Hendrix insisted. \"'Purple Haze' was all about a dream I had that I was walking under the sea.\""
  },
  {
    "title": "Blood on the Tracks",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-dylan-blood-on-the-tracks-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/d7f732b2975aa5f48929bab82e158620c28021ee.JPG",
    "artist": "Bob Dylan",
    "rank": 16,
    "label": "Columbia",
    "year": 1975,
    "summary": "Bob Dylan once introduced this album's opening song, \"Tangled Up in Blue,\" onstage as taking him 10 years to live and two years to write. It was, for him, a pointed reference to the personal crisis - the collapse of his marriage to Sara Lowndes - that at least partly inspired this album, Dylan's best of the 1970s. In fact, he wrote all of these lyrically piercing, gingerly majestic songs in two months, in mid-1974. He was so proud of them that he privately auditioned almost all of the album, from start to finish, for pals and peers including Mike Bloomfield, David Crosby and Graham Nash before cutting them in September - in just a week, with members of the bluegrass band Deliverance. But in December, Dylan played the record for his brother David in Minneapolis, who suggested recutting some songs with local musicians. The final Blood was a mix of the slow, pensive New York sessions and the faster, wilder Minneapolis dates. Together, they frame the gritty anguish in some of Dylan's most passionate, confessional songs - from adult breakup ballads like \"If You See Her, Say Hello\" to the sharp-tongued opprobrium of \"Idiot Wind,\" his greatest put-down song since \"Like a Rolling Stone.\" \"It's hard for me to relate to people enjoying that type of pain,\" Dylan said after the album became an instant success. Yet he had never turned so much pain into so much musical splendor."
  },
  {
    "title": "Nevermind",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/nirvana-nevermind-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/21ccd83b5593ecaed7b7b09b5bcfa2aed935b208.JPG",
    "artist": "Nirvana",
    "rank": 17,
    "label": "Geffen",
    "year": 1991,
    "summary": "The overnight-success story of the 1990s, Nirvana's second album and its totemic first single, \"Smells Like Teen Spirit,\" shot up from the nascent grunge scene in Seattle to kick Michael Jackson off the top of the Billboard album chart and blow hair metal off the map. No album in recent history had such an overpowering impact on a generation - a nation of teens suddenly turned punk - and such a catastrophic effect on its main creator. The weight of fame led already troubled singer-guitarist Kurt Cobain to take his own life in 1994. But his slashing riffs, corrosive singing and deviously oblique writing, rammed home by the Pixies-via-Zeppelin might of bassist Krist Novoselic and drummer Dave Grohl, put the warrior purity back in rock & roll. Lyrically, Cobain raged in code - shorthand grenades of inner tumult and self-loathing. His genius, though, in songs like \"Lithium,\" \"Breed\" and \"Teen Spirit\" was the soft-loud tension he created between verse and chorus, restraint and assault. Cobain was a pop lover at heart - and a Beatlemaniac: Nevermind producer Butch Vig remembers hearing Cobain play John Lennon's \"Julia\" at sessions. Cobain also fought to maintain his underground honor. Ultimately, it was a losing battle, but it is part of this album's enduring power. Vig recalls when Cobain was forced to overdub the guitar intro to \"Teen Spirit\" because he couldn't nail it live with the band: \"That pissed him off. He wanted to play [the song] live all the way through.\""
  },
  {
    "title": "Born to Run",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bruce-springsteen-born-to-run-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/1ccdff7c10d78ca236e7272be46db2562737945a.JPG",
    "artist": "Bruce Springsteen",
    "rank": 18,
    "label": "Columbia",
    "year": 1975,
    "summary": "Bruce Springsteen spent everything he had - patience, energy, studio time, the physical endurance of his E Street Band - to make his masterpiece. There are a dozen guitar overdubs on the title track alone. \"The album became a monster,\" Springsteen recalled. But in making his third album, he was living out the central drama in its gun-the-engine rock & roll: the fight to reconcile big dreams with crushing reality. He found it so hard to re-create the sound in his head - the Jersey-bar dynamite of his live gigs, Phil Spector's grandeur, Roy Orbison's melodrama - that he nearly gave up and put out a live album. But his attention to detail produced a timeless record about the labors and glories of aspiring to greatness."
  },
  {
    "title": "Astral Weeks",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/van-morrison-astral-weeks-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/6f9fc2c6fadb5ba8118b7baa2cd016ddebee2f26.JPG",
    "artist": "Van Morrison",
    "rank": 19,
    "label": "Warner Bros.",
    "year": 1968,
    "summary": "Van Morrison never sounded more warm and ecstatic, more sensual and vulnerable, than on his enigmatically beautiful solo debut. Fresh off the success of \"Brown Eyed Girl\" and newly signed to artistfriendly Warner Bros., he explored the physical and dramatic range of his voice during extended poetic-scat singing, and set hallucinatory reveries on his native Belfast to wandering Celtic-R&B melodies. The crowning touch was the superior jazz quintet convened by producer Lewis Merenstein to color the mists and shadows. Bassist Richard Davis later said that Morrison never told the musicians what he wanted from them or what the lyrics meant. Maybe he didn't know how to. He was going deep inside himself, without a net or fear."
  },
  {
    "title": "Thriller",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/michael-jackson-thriller-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/5f1d3499fb3eed91d03d8c94213829d42fb87658.JPG",
    "artist": "Michael Jackson",
    "rank": 20,
    "label": "Epic",
    "year": 1982,
    "summary": "Michael Jackson towered over the 1980s the way Elvis Presley dominated the 1950s, and here's why. On Thriller, the child R&B star ripened into a Technicolor soulman: a singer, dancer and songwriter with incomparable crossover instincts. He and producer Quincy Jones established the something-for-everyone template with 1979's Off the Wall, a crisp fusion of pop hooks and dance beats. On Thriller, the pair heighten the sheen (\"The Girl Is Mine\"), pump up the theater (\"Thriller\") and deepen the funk. But the most thrilling thing was the autobiography busting through the gloss: the hiss of denial on \"Billie Jean\"; the to-hell-with-haters strut of \"Wanna Be Startin' Somethin'.\" Jackson was at the peak of his art and adulthood."
  },
  {
    "title": "The Great Twenty-Eight",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/chuck-berry-the-great-twenty-eight-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/fc435e4ac67a99344a3f87b874346a03bb864a0d.JPG",
    "artist": "Chuck Berry",
    "rank": 21,
    "label": "Chess",
    "year": 1982,
    "summary": "In the latter half of the Fifties, Chuck Berry released a string of singles that defined the sound and spirit of rock & roll. \"Maybellene,\" a fast, countryish rocker about a race between a Ford and a Cadillac, kicked it all off in 1955, and one classic hit followed another, each powered by Berry's staccato country-blues-guitar gunfire: \"Roll Over Beethoven,\" \"School Days,\" \"Rock and Roll Music,\" \"Sweet Little Sixteen,\" \"Johnny B. Goode,\" \"Back in the USA.\" What was Berry's secret? In the maestro's own words, \"The nature and backbone of my beat is boogie, and the muscle of my music is melodies that are simple.\" This collection culls the best of that magic from 1955 to 1965."
  },
  {
    "title": "The Complete Recordings",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/robert-johnson-the-complete-recordings-20120525",
    "cover": "http://assets.rollingstone.com/assets/images/list/d728ac46e2ce3da52113fcb8e4e593dac64015d6.jpg",
    "artist": "Robert Johnson",
    "rank": 22,
    "label": "Columbia",
    "year": 1990,
    "summary": "\"You want to know how good the blues can get?\" Keith Richards asked. \"Well, this is it.\" The bluesman in question was Robert Johnson, who lived from 1911 to 1938 in the Mississippi Delta, and whose guitar prowess was so great, it inspired stories that he had sold his soul to the devil in exchange for his amazing gift. In his only two recording sessions, Johnson cut just 29 songs, but their evanescent passion has resonated through the decades, crucial inspiration for everyone from Chicago blues originator Elmore James to British blues inheritors like the Stones and Eric Clapton. Every one of his songs (along with 12 alternate takes) is included here - a holy grail of the blues."
  },
  {
    "title": "Plastic Ono Band",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/john-lennon-plastic-ono-band-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/3de737814351d39eb4854aed81106f8b2f7564e3.JPG",
    "artist": "John Lennon",
    "rank": 23,
    "label": "Capitol",
    "year": 1970,
    "summary": "Also known as the \"primal scream\" album, referring to the painful therapy that gave rise to its songs, Plastic Ono Band was John Lennon's first proper solo album and rock & roll's most self-revelatory recording. Lennon attacks and denies idols and icons, including his own former band (\"I don't believe in Beatles,\" he sings in \"God\"), to hit a pure, raw core of confession that, in its echo-drenched, garage-rock crudity, is years ahead of punk. He deals with childhood loss in \"Mother\" and skirts blasphemy in \"Working Class Hero\": \"You're still fucking peasants as far as I can see.\" But consigning Sixties dreams to the rubbish bin, there's also room for a fragile sense of possibility (see \"Hold On\"). Plastic Ono Band is the sound of Year Zero."
  },
  {
    "title": "Innervisons",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/stevie-wonder-innervisons-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/cd9ed0f8f7ee429ef0f61b2e111a7bbce304f001.JPG",
    "artist": "Stevie Wonder",
    "rank": 24,
    "label": "Tamala",
    "year": 1973,
    "summary": "Stevie Wonder's high-flying musical experimentation and penetrating lyrical insight made Innervisions a textured, but never self-indulgent, work of soulful self-discovery. Fusing social realism with spiritual idealism, he brings expressive color and irresistible funk to his keyboards on \"Too High\" (a cautionary anti-drug song) and \"Higher Ground\" (which echoes Martin Luther King Jr.'s message of transcendence). The album's centerpiece is \"Living for the City,\" a cinematic depiction of exploitation and injustice. He brought his most innovative music to life in the nick of time: Three days after Innervisions was released, Wonder was put into a four-day coma after the car he was traveling in collided with a logging truck."
  },
  {
    "title": "Live at the Apollo",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/james-brown-live-at-the-apollo-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/b56e02aec79042fa9b1af99d683ded0c8a2bd461.JPG",
    "artist": "James Brown",
    "rank": 25,
    "label": "King",
    "year": 1963,
    "summary": "Perhaps the greatest live album ever recorded. From the breathless buildup of the spoken intro through terse, sweat-soaked early hits such as \"Try Me\" and \"Think\" into 11 minutes of the raw ballad \"Lost Someone,\" climaxing with a frenzied nine-song medley and ending with \"Night Train,\" Live at the Apollo is pure, uncut soul. And it almost didn't happen. James Brown defied King Records label boss Syd Nathan's opposition to a live album by arranging to record a show himself - on October 24th, 1962, the last date in a run at Harlem's historic Apollo Theater. His intuition proved correct: Live at the Apollo - the first of four albums Brown recorded there - charted for 66 weeks."
  },
  {
    "title": "Rumours",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/fleetwood-mac-rumours-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/cbb03ec26a73d7619600851e27bddf3511abf4de.JPG",
    "artist": "Fleetwood Mac",
    "rank": 26,
    "label": "Warner Bros.",
    "year": 1977,
    "summary": "On Rumours, Fleetwood Mac turned private turmoil into gleaming, melodic public art. The band's two couples - bassist John and singer-keyboard player Christine McVie, who were married; guitarist Lindsey Buckingham and vocalist Stevie Nicks, who were not - were in the midst of breakups during the album's protracted sessions. This lent a highly charged, confessional aura to songs like Buckingham's \"Go Your Own Way,\" Nicks' \"Dreams,\" Christine's \"Don't Stop\" and the group-composed anthem to betrayal, \"The Chain.\" The Mac's catchy exposés, produced with California-sunshine polish, touched a nerve: Rumours became the gold standard of late-Seventies FM radio and the seventh-bestselling studio album of all time."
  },
  {
    "title": "The Joshua Tree",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/u2-the-joshua-tree-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/520bddc06d6e0cc15e5e664403130b7f82c647ed.JPG",
    "artist": "U2",
    "rank": 27,
    "label": "Island",
    "year": 1987,
    "summary": "\"America's the promised land to a lot of Irish people,\" Bono told Rolling Stone. \"I'm one in a long line of Irishmen who made the trip.\" On U2's fifth studio album, the band immersed itself in the mythology of the United States, while the Edge exploited the poetic echo of digital delay, drowning his trademark arpeggios in rippling tremolo. One of the most moving songs is \"Running to Stand Still,\" a stripped-down slide-guitar ballad about heroin addiction, but for the most part this is an album that turns spiritual quests and political struggles into uplifting stadium singalongs: See hits like \"Where the Streets Have No Name\" and \"I Still Haven't Found What I'm Looking For,\" a rock anthem with a gospel soul."
  },
  {
    "title": "Who's Next",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-who-whos-next-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/8771b654101c38cee38046c90461899f4609dcc7.JPG",
    "artist": "The Who",
    "rank": 28,
    "label": "Decca",
    "year": 1971,
    "summary": "Pete Townshend said he suffered a nervous breakdown when his planned follow-up to the rock opera Tommy, the ambitious, theatrical Lifehouse, fell apart. But he was left with an extraordinary cache of songs that the Who honed for what became their best studio album, Who's Next. \"Won't Get Fooled Again,\" \"Bargain\" and \"Baba O'Riley\" (named in tribute to avant-garde composer Terry Riley and Townshend's spiritual guru Meher Baba) all beam with epic majesty, often spiked with synthesizers. \"I like synthesizers,\" Townshend said, \"because they bring into my hands things that aren't in my hands: the sound of the orchestra, French horns, strings... You press a switch and it plays it back at double speed.\""
  },
  {
    "title": "Led Zeppelin",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/led-zeppelin-led-zeppelin-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/f46de354cee13132e928bb4793b21bf466deddcf.JPG",
    "artist": "Led Zeppelin",
    "rank": 29,
    "label": "Atlantic",
    "year": 1969,
    "summary": "On their first album, Led Zeppelin were still in the process of inventing their own sound, moving on from the heavy rave-ups of guitarist Jimmy Page's previous band, the Yardbirds. But from the beginning, Zeppelin had the astonishing fusion of Page's lyrical guitar-playing, Robert Plant's paint-peeling love-hound yowl, and John Paul Jones and John Bonham's avalanche boogie. \"We were learning what got us off most and what got people off most,\" said Plant. Yet the template for everything Zeppelin achieved in the 1970s is here: brutal rock (\"Communication Breakdown\"), thundering power balladry (\"Your Time Is Gonna Come\"), acid-flavored folk blues (\"Babe I'm Gonna Leave You\"). Heavy metal still lives in its shadow."
  },
  {
    "title": "Blue",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/joni-mitchell-blue-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/028f49baec27d23d1cb2aab9039fd5c59cebcfa8.JPG",
    "artist": "Joni Mitchell",
    "rank": 30,
    "label": "Reprise",
    "year": 1971,
    "summary": "\"The Blue album, there's hardly a dishonest note in the vocals,\" Joni Mitchell told Rolling Stone in 1979. \"At that period of my life, I had no persona defenses. I felt like a cellophane wrapper on a pack of cigarettes. I felt like I had absolutely no secrets from the world, and I couldn't pretend in my life to be strong. Or to be happy.\" With song after song of regrets and sorrow, this may be the ultimate breakup album. Its whispery minimalism is also Mitchell's greatest musical achievement. Stephen Stills and James Taylor lend an occasional hand, but in \"California,\" \"Carey,\" \"This Flight Tonight\" and the devastating title track, Mitchell sounds utterly alone in her melancholy, turning the sadness into tender, universally powerful art."
  },
  {
    "title": "Bringing It All Back Home",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-dylan-bringing-it-all-back-home-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/269c3d6190e2dc0dc53c9692a3fccb1b0297d8ba.JPG",
    "artist": "Bob Dylan",
    "rank": 31,
    "label": "Columbia",
    "year": 1965,
    "summary": "\"It's very complicated to play with electricity,\" Bob Dylan said in the summer of 1965. \"You're dealing with other people... Most people who don't like rock & roll can't relate to other people.\" But on Side One of this pioneering album, Dylan amplifies his cryptic, confrontational songwriting with guitar lightning and galloping drums. \"Subterranean Homesick Blues\" and \"Maggie's Farm\" are loud, caustic and funny as hell. Dylan returns to solo acoustic guitar on the four superb songs on Side Two, including the scabrous \"It's Alright, Ma (I'm Only Bleeding)\" and the closing ballad, \"It's All Over Now, Baby Blue,\" arguably his finest, most affectionate song of dismissal."
  },
  {
    "title": "Let It Bleed",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-rolling-stones-let-it-bleed-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/33e6772d3021760a05f42698be40425d1e5302b3.JPG",
    "artist": "The Rolling Stones",
    "rank": 32,
    "label": "London",
    "year": 1969,
    "summary": "The Rolling Stones' final record of the Sixties kicks off with the terrifying \"Gimme Shelter,\" the song that came to symbolize not only the catastrophe of the Stones' free show at Altamont but the death of the decade's utopian spirit. And the entire album burns with apocalyptic cohesion: the sex-mad desperation of \"Live With Me\"; the murderous blues of \"Midnight Rambler\"; Keith Richards' lethal, biting guitar on \"Monkey Man\"; the epic moralism, with honky-tonk piano and massed vocal chorus, of \"You Can't Always Get What You Want,\" which Mick Jagger wrote on acoustic guitar in his bedroom. \"Somebody said that we could get the London Bach Choir,\" Jagger recalled years later, \"and we said, 'That will be a laugh.'\""
  },
  {
    "title": "Ramones",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/ramones-ramones-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/e9c37a4eaa1dfdd20c30153be4966ef0059eea5b.JPG",
    "artist": "Ramones",
    "rank": 33,
    "label": "Sire",
    "year": 1976,
    "summary": "\"Our early songs came out of our real feelings of alienation, isolation, frustration - the feelings everybody feels between 17 and 75,\" said singer Joey Ramone. Clocking in at just over 28 minutes, Ramones is a complete rejection of the spangled artifice of 1970s rock. The songs are fast and anti-social, just like the band: \"Beat on the Brat,\" \"Blitzkrieg Bop,\" \"Now I Wanna Sniff Some Glue.\" Guitarist Johnny Ramone refused to play solos - his jackhammer chords became the lingua franca of punk - and the whole thing was recorded for just over $6,000. Yet amid the buoyantly nihilist fury, Joey Ramone's leather-tender plea \"I Wanna Be Your Boyfriend\" showed that even punks need love."
  },
  {
    "title": "Music From Big Pink",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-band-music-from-big-pink-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/53ea5be949478362759c48a2709486aa141fd212.JPG",
    "artist": "The Band",
    "rank": 34,
    "label": "Capitol",
    "year": 1968,
    "summary": "\"Big Pink\" was a pink house in Woodstock, New York, where the Band - Bob Dylan's '65-'66 backup band on tour - moved to be near Dylan after his motorcycle accident. While he recuperated, the Band backed him on the demos later known as The Basement Tapes [see No. 292] and made their own debut. Dylan offered to play on the album; the Band said no thanks. \"We didn't want to just ride his shirttail,\" drummer Levon Helm said. Dylan contributed \"I Shall Be Released\" and co-wrote two other tunes. But it was the rustic beauty of the Band's music and the drama of their own reflections on family and obligations, on songs such as \"The Weight,\" that made Big Pink an instant homespun classic."
  },
  {
    "title": "The Rise and Fall of Ziggy Stardust and the Spiders From Mars",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/david-bowie-the-rise-and-fall-of-ziggy-stardust-and-the-spiders-from-mars-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/796577260b3b30587c896ff08e32c4b39c96e207.JPG",
    "artist": "David Bowie",
    "rank": 35,
    "label": "RCA",
    "year": 1972,
    "summary": "This album documents one of the most elaborate self-mythologizing schemes in rock, as David Bowie created the glittery, messianic alter ego Ziggy Stardust (\"well-hung and snow-white tan\"). The glam rock Bowie made with guitarist Mick Ronson on tracks like \"Hang on to Yourself\" and \"Suffragette City\" is an irresistible blend of sexy, campy pop and blues power. The anthem \"Ziggy Stardust\" is one of rock's earliest, and best, power ballads. \"I consider myself responsible for a whole new school of pretensions,\" Bowie said at the time. \"They know who they are. Don't you, Elton? Just kidding. No, I'm not.\""
  },
  {
    "title": "Tapestry",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/carole-king-tapestry-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/665baaa4458af3052fe54e61b4f877ff0fdbfee4.JPG",
    "artist": "Carole King",
    "rank": 36,
    "label": "Ode",
    "year": 1971,
    "summary": "For nearly a decade, Carole King wrote Brill Building pop with her then-husband, Gerry Goffin: hits such as Little Eva's \"The Loco-Motion\" (Eva Boyd was the couple's baby sitter) and the Monkees' \"Pleasant Valley Sunday.\" Then King's friend James Taylor encouraged her to sing her own tunes. She slowed down \"Will You Love Me Tomorrow\" (originally a hit for the Shirelles in 1960), heightening the melancholy inside, while her warm, earnest singing brought out the sadness in \"So Far Away\" and \"It's Too Late\" and the earthy joy on \"I Feel the Earth Move.\" On Tapestry, King remade herself as an artist and created the reigning model for the 1970s female singer-songwriter - not to mention a blockbuster pop record of enduring artistic quality."
  },
  {
    "title": "Hotel California",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-eagles-hotel-california-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c1cb2fd484afdaff16cb9f5c0a397c120ff3f74a.JPG",
    "artist": "The Eagles",
    "rank": 37,
    "label": "Asylum",
    "year": 1976,
    "summary": "In pursuit of note-perfect Hollywood-cowboy ennui, the Eagles spent eight months in the studio polishing take after take after take. As Don Henley recalled, \"We just locked ourselves in. We had a refrigerator, a ping-pong table, roller skates and a couple of cots. We would go in and stay for two or three days at a time.\" With guitarist Joe Walsh replacing Bernie Leadon, the band backed off from straight country rock in favor of the harder sound of \"Life in the Fast Lane.\" The somber \"New Kid in Town\" ponders the fleeting nature of fame, and the title track is a monument to the rock-aristocrat decadence of the day and a feast of triple-guitar interplay. \"Every band has their peak,\" Henley said. \"That was ours.\""
  },
  {
    "title": "The Anthology",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/muddy-waters-the-anthology-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/fe53e95b3d42bfba65bdf63893ac156bda42c4a9.JPG",
    "artist": "Muddy Waters",
    "rank": 38,
    "label": "Chess/MCA",
    "year": 2001,
    "summary": "McKinley Morganfield - a.k.a. Muddy Waters - started out playing acoustic Delta blues in Mississippi. But when he moved to Chicago in 1943, he needed an electric guitar to be heard over the tumult of South Side clubs. The sound he developed was the foundation of Chicago blues - and rock & roll; the thick, bleeding tones of his slide work anticipated rock-guitar distortion by nearly two decades. Jimi Hendrix adapted Waters' \"Rollin' Stone\" for \"Voodoo Chile,\" Bob Dylan found inspiration in it for \"Like a Rolling Stone,\" and Mick Jagger and Keith Richards took their band's name from it. The 50 cuts on these two CDs run from guitar-and-stand-up-bass duets to full-band romps - and they only scratch the surface of Waters' legacy."
  },
  {
    "title": "Please Please Me",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-please-please-me-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/a98228297da2e4b977752517870aa0f0084a260d.JPG",
    "artist": "The Beatles",
    "rank": 39,
    "label": "Parlophone",
    "year": 1963,
    "summary": "The Beatles recorded 10 of the 14 songs on their debut album at EMI's Abbey Road studio in just over 12 hours on February 11th, 1963. For productivity alone, it's one of the greatest first albums in rock. The Beatles had already invented a bracing new sound for a rock band - an assault of thrumming energy and impeccable vocal harmonies - and they nailed it using the covers and originals in their live repertoire: the Shirelles' \"Boys\" and Arthur Alexander's \"Anna\"; the Lennon-McCartney burners \"There's a Place\" and \"I Saw Her Standing There.\" Fittingly, John Lennon finished the epochal all-day session shirtless and shredding what was left of his vocal cords on two takes of \"Twist and Shout.\""
  },
  {
    "title": "Forever Changes",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/love-forever-changes-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/98c7140da22f3d65f5af7dc59af391d8abd0ee52.JPG",
    "artist": "Love",
    "rank": 40,
    "label": "Elektra",
    "year": 1967,
    "summary": "\"When I did that album,\" singer Arthur Lee said, \"I thought I was going to die at that particular time, so those were my last words.\" Lee, who died of cancer in 2006, was still performing this album live well into the '00s. And for good reason: The third record by his biracial L.A. band is wild and funny and totally pioneering: folk rock turned into elegant Armageddon with the symphonic sweep and mariachi-brass drama of \"Alone Again Or\" and \"You Set the Scene.\" In the late Nineties, Lee served time in prison. After his release, he brought extra pathos to \"Live and Let Live\" when he sang, \"Served my time, served it well.\""
  },
  {
    "title": "Never Mind the Bollocks, Here's the Sex Pistols",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-sex-pistols-never-mind-the-bollocks-heres-the-sex-pistols-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ad8c0086034df4e67974c150d0f4f8ec469584eb.JPG",
    "artist": "The Sex Pistols",
    "rank": 41,
    "label": "Warner Bros.",
    "year": 1977,
    "summary": "\"If the sessions had gone the way I wanted, it would have been unlistenable for most people,\" Johnny Rotten said. \"If you want people to listen, you’re going to have to compromise.\" But few heard it that way at the time. The Pistols' only studio album sounds like a rejection of everything rock & roll had to offer. True, the music was less shocking than Rotten himself, who snarled about abortions, anarchy and hatred. But Never Mind. . . is the Sermon on the Mount of U.K. punk - and its echoes are everywhere."
  },
  {
    "title": "The Doors",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-doors-the-doors-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/1ea331d7c82fbb8fa7071b77d4f657b109d1c788.JPG",
    "artist": "The Doors",
    "rank": 42,
    "label": "Elektra",
    "year": 1967,
    "summary": "After blowing minds as the house band at L.A.'s Whisky-a-Go-Go, where they got fired for playing the Oedipal drama \"The End,\" the Doors were ready to unleash their organ-driven rock on the world. \"On each song we had tried every possible arrangement,\" drummer John Densmore said, \"so we felt the whole album was tight.\" The Blakean pop art on their debut was beyond Top 40 attention spans. But they hit pay dirt by editing down one of their jams: \"Light My Fire,\" written by guitarist Robbie Krieger when Jim Morrison told everybody in the band to write a song with universal imagery."
  },
  {
    "title": "The Dark Side of the Moon",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/pink-floyd-the-dark-side-of-the-moon-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/861c5694612fa245049704a6d3ab31387b19c834.JPG",
    "artist": "Pink Floyd",
    "rank": 43,
    "label": "EMI",
    "year": 1973,
    "summary": "\"I think every album was a step toward Dark Side of the Moon,\" keyboardist Rick Wright said. \"We were learning all the time; the techniques of the recording and our writing was getting better.\" As a culmination of their inner-space explorations of the early 1970s, the Floyd toured the bulk of Dark Side in Britain for months prior to recording. But in the studio, the band articulated bassist Roger Waters' reveries on the madness of everyday life with melodic precision (\"Breathe,\" \"Us and Them\") and cinematic luster (Clare Torry's guest-vocal aria, \"The Great Gig in the Sky\"). It's one of the best-produced rock albums ever, and \"Money\" may be the only Top 20 hit in 7/4 time."
  },
  {
    "title": "Horses",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/patti-smith-horses-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/e7a996baf4047f8daed97e5f5bd4490fb7c1f697.JPG",
    "artist": "Patti Smith",
    "rank": 44,
    "label": "Arista",
    "year": 1975,
    "summary": "From its first defiant line, \"Jesus died for somebody's sins, but not mine,\" the opening shot in a bold reinvention of Van Morrison's Sixties garage-rock classic \"Gloria,\" Patti Smith's debut album was a declaration of committed mutiny, a statement of faith in the transfigurative powers of rock & roll. Horses made her the queen of punk before it even really existed, but Smith cared more for the poetry in rock. She sought the visions and passions that connected Keith Richards and Rimbaud - and found them, with the intuitive assistance of a killing band (pianist Richard Sohl, guitarist Lenny Kaye, bassist Ivan Kral and drummer Jay Dee Daugherty) and her friend Robert Mapplethorpe, who shot the stark, beautiful cover portrait."
  },
  {
    "title": "The Band",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-band-the-band-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/0ac466eab206d17e99e3329c482993dab1bee18d.JPG",
    "artist": "The Band",
    "rank": 45,
    "label": "Capitol",
    "year": 1969,
    "summary": "The Band were four-fifths Canadian - drummer Levon Helm was from Arkansas - but their second album is all American. Guitarist Robbie Robertson's songs vividly evoke the country's pioneer age (\"Across the Great Divide\") and the Civil War (\"The Night They Drove Old Dixie Down\"), while reflecting the fractured state of the nation in the 1960s. The Band's long life on the road resonates in the brawn of Garth Hudson's keyboards and Helm's juke-joint attack. But Robertson's stories truly live in Helm's growl, Rick Danko's high tenor and Richard Manuel's spectral croon. \"Somebody once said he had a tear in his voice,\" Helm said of Manuel. \"Richard had one of the richest-textured voices I'd ever heard.\""
  },
  {
    "title": "Legend",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-marley-and-the-wailers-legend-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/96be4f1be7b743e59bc37c675556ee33492da56d.JPG",
    "artist": "Bob Marley and the Wailers",
    "rank": 46,
    "label": "Island",
    "year": 1984,
    "summary": "Bob Marley said, \"Reggae music is too simple for [American musicians]. You must be inside of it, know what's happening, and why you want to play this music. You don't just run and go play this music because you think you can make a million off it.\" Ironically, this set of the late reggae idol's greatest hits has sold in the millions worldwide. In a single disc, it captures everything that made him an international icon: his nuanced songcraft, his political message (and savvy), and - of course - the universal soul he brought to Jamaican rhythm and Rastafarian spirituality in the gunfighter ballad \"I Shot the Sheriff,\" the comforting swing of \"No Woman, No Cry\" and the holy promise of \"Redemption Song.\""
  },
  {
    "title": "A Love Supreme",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/john-coltrane-a-love-supreme-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/02531855485466bc333d2947a4dd31f2b9f61748.JPG",
    "artist": "John Coltrane",
    "rank": 47,
    "label": "Impulse",
    "year": 1964,
    "summary": "Two important things happened to John Coltrane in 1957: The saxophonist left Miles Davis' employ to join Thelonious Monk's band and hit new heights in extended, ecstatic soloing. Coltrane also kicked heroin addiction, a vital step in a spiritual awakening that climaxed with this legendary album-long hymn of praise - transcendent music perfect for the high point of the civil rights movement. The indelible four-note theme of the first piece, \"Acknowledgment,\" is the humble foundation of the suite. But Coltrane's majestic, often violent blowing (famously described as \"sheets of sound\") is never self-aggrandizing. His playing soars with nothing but gratitude and joy. You can't help but go with him."
  },
  {
    "title": "It Takes a Nation of Millions to Hold Us Back",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/public-enemy-it-takes-a-nation-of-millions-to-hold-us-back-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/0f1f21ff75e649209670aa34b650d8b0f3a7b9ef.JPG",
    "artist": "Public Enemy",
    "rank": 48,
    "label": "Def Jam",
    "year": 1988,
    "summary": "Loud, obnoxious, funky, avant-garde, political, hilarious - Public Enemy's brilliant second album is all of these things, all at once. Chuck D booms intricate rhymes with a delivery inspired by sportscaster Marv Albert; sidekick Flavor Flav raps comic relief; and production team the Bomb Squad builds mesmerizing, multilayered jams, pierced with shrieking sirens. The title and roiling force of \"Bring the Noise\" is truth in advertising. \"If they're callin' my music 'noise,'\" said Chuck D, \"if they're saying that I'm really getting out of character being a black person in America, then fine - I'm bringin' more noise.\""
  },
  {
    "title": "At Fillmore East",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-allman-brothers-band-at-fillmore-east-20120531",
    "cover": "http://assets.rollingstone.com/assets/images/list/effe20936e258567d11473ae17e244dac6b208d8.JPG",
    "artist": "The Allman Brothers Band",
    "rank": 49,
    "label": "Mercury",
    "year": 1971,
    "summary": "Rock's greatest live double LP is an unbeatable testimony to the Allman Brothers' improvisational skills, as well as evidence of how they connected with audiences to make jamming feel communal. \"The audience would kind of play along with us,\" singerorganist Gregg Allman said of the March 1971 shows documented here. \"They were right on top of every single vibration coming from the stage.\" The dazzling guitar team of Duane Allman and Dickey Betts was at its peak, seamlessly fusing blues and jazz in \"Whipping Post\" and \"In Memory of Elizabeth Reed.\" But their telepathy was interrupted: Just three months after the album's release, Duane died in a motorcycle accident."
  },
  {
    "title": "Here's Little Richard",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/little-richard-heres-little-richard-20120531",
    "cover": "http://assets.rollingstone.com/assets/images/list/7a68ae240f7399bef642adb1c492ac20ab664b33.jpg",
    "artist": "Little Richard",
    "rank": 50,
    "label": "Specialty",
    "year": 1957,
    "summary": "\"I came from a family where my people didn't like rhythm & blues,\" Little Richard told Rolling Stone in 1970. \"Bing Crosby, 'Pennies From Heaven,' Ella Fitzgerald was all I heard. And I knew there was something that could be louder than that, but didn't know where to find it. And I found it was me.\" Richard's raucous 1957 debut album collected singles such as \"Rip It Up\" and \"Long Tall Sally,\" in which his rollicking boogie-woogie piano and falsetto scream ignited the unfettered possibilities of rock & roll. \"Tutti Frutti\" still contains what has to be considered the most inspired rock lyric ever recorded: \"A wop bop alu bop, a wop bam boom!\""
  },
  {
    "title": "Bridge Over Troubled Water",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/simon-and-garfunkel-bridge-over-troubled-water-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/0a328443dbf33f1e8724c5223b2d97fca48106c5.JPG",
    "artist": "Simon and Garfunkel",
    "rank": 51,
    "label": "Columbia",
    "year": 1970,
    "summary": "On their fifth and final studio album, Paul Simon and Art Garfunkel were pulling away from each other: Simon assembled some of it while Garfunkel was in Mexico starting his acting career with a part in the film version of Catch-22. Garfunkel vetoed Simon's \"Cuba Sí, Nixon No,\" and Simon nixed Garfunkel's idea for a Bach chorale. But what remains is the partnership at its best: wry, wounded songs with healing harmonies such as \"The Boxer,\" though the gorgeous title track was sung by Garfunkel alone, despite his resistance. \"He felt I should have done it,\" Simon told Rolling Stone in 1972. \"And many times I'm sorry I didn't do it.\""
  },
  {
    "title": "Greatest Hits",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/al-green-greatest-hits-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/e9ed00227a28b80f6c6796798da58c5a6958eec2.JPG",
    "artist": "Al Green",
    "rank": 52,
    "label": "Hi",
    "year": 1975,
    "summary": "Al Green made some of the most visionary soul music of the Seventies, in Memphis with producer Willie Mitchell. \"In Memphis, you just do as you feel,\" he told Rolling Stone in 1972. \"It's not a modern, up-to-par, very glamorous, big-red-chairs-and-carpet-that-thick studio. It's one of those places you can go into and stomp out a good soul jam.\" In collaboration with Mitchell and subtly responsive musicians like drummer Al Jackson Jr., Green was a natural album artist, making love-and-pain classics such as 1973's Call Me. But this collection makes for a unified album in itself, compiling hits like \"Let's Stay Together,\" \"I'm Still in Love With You\" and \"Tired of Being Alone\" into a flawless 10-song suite."
  },
  {
    "title": "Meet the Beatles!",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-beatles-meet-the-beatles-20120530",
    "cover": "http://assets.rollingstone.com/assets/images/list/c567aea05a250999e7e2046d49200a11d83d290a.JPG",
    "artist": "The Beatles",
    "rank": 53,
    "label": "Capitol",
    "year": 1964,
    "summary": "For Americans in the full grip of Beatlemania, this was the first album they could buy. Meet took the Fab Four's second British record, With the Beatles, dropped five covers and added three tracks, including the singles \"I Want to Hold Your Hand\" and \"I Saw Her Standing There.\" (This may have made a hash of the Beatles' artistic intentions, but it made for a much better record.) John Lennon and Paul McCartney were on a songwriting roll that would be unmatched in rock history, and at this point they were still a real team. They wrote \"I Want to Hold Your Hand\" together on a piano in the basement of Jane Asher, McCartney's actress girlfriend - as Lennon put it, \"eyeball  to eyeball.\""
  },
  {
    "title": "The Birth of Soul: The Complete Atlantic Recordings",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/ray-charles-the-birth-of-soul-the-complete-atlantic-recordings-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/7a56419fc667671522a7cb18f9a0fd66c0ca04ae.JPG",
    "artist": "Ray Charles",
    "rank": 54,
    "label": "Atlantic",
    "year": 1991,
    "summary": "Soul music is a blend of the holy and the filthy: gospel and blues rubbing up against each other. And Ray Charles was just about the first person to perfect that mix. Charles was knocking around Seattle when Atlantic bought out his contract in 1952. For the next seven years, he turned out brilliant singles such as \"What'd I Say\" and \"I Got a Woman,\" which was a takeoff on a gospel tune, \"It Must Be Jesus.\" He was inventing the sound of ecstasy, three minutes at a time. This box collects every R&B side he cut for Atlantic, though his swinging take on \"My Bonnie\" will have you thinking it covers his Atlantic jazz output as well."
  },
  {
    "title": "Electric Ladyland",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-jimi-hendrix-experience-electric-ladyland-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/876329989fb53101df678baaf238180b18820803.JPG",
    "artist": "The Jimi Hendrix Experience",
    "rank": 55,
    "label": "Reprise",
    "year": 1968,
    "summary": "Hendrix's third album was the first he produced himself, a fever dream of underwater electric soul cut in round-the-clock sessions at the Record Plant in New York. Hendrix would leave the Record Plant to jam at a club around the corner, the Scene, and \"Voodoo Chile\" - 15 minutes of live in-the-studio blues exploration with Steve Winwood on organ and Jefferson Airplane's Jack Casady on bass - reflects those excursions. In addition to psychedelic Delta blues, there was the precision snap of \"Crosstown Traffic\" and a cover of \"All Along the Watchtower\" that took Bob Dylan into outer space before touching down with a final burst of spectral fury."
  },
  {
    "title": "Elvis Presley",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/elvis-presley-elvis-presley-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/3d96d5d6d9bcbc6282936dc1ffd06578cabebc32.JPG",
    "artist": "Elvis Presley",
    "rank": 56,
    "label": "RCA",
    "year": 1956,
    "summary": "In November 1955, RCA Records bought Presley's contract, singles and unreleased master tapes from Sun Records. His first full-length album came out six months later, with tracks drawn from both the Sun sessions and further recordings at RCA's studios in New York and Nashville. It became the first rock & roll album to make it to Number One on the Billboard charts. \"There wasn't any pressure,\" guitarist Scotty Moore said of the first RCA sessions. \"They were just bigger studios with different equipment. We basically just went in and did the same thing we always did.\" On tracks such as \"Blue Suede Shoes,\" that meant revved-up country music with the sexiest voice anyone had ever heard."
  },
  {
    "title": "Songs in the Key of Life",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/stevie-wonder-songs-in-the-key-of-life-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/1becb7e01d2771e049f1a09ffd58cd77f0e146a2.JPG",
    "artist": "Stevie Wonder",
    "rank": 57,
    "label": "Motown/Universal",
    "year": 1976,
    "summary": "Making this record, Stevie Wonder would often stay in the studio 48 hours straight, not eating or sleeping, while everyone around him struggled to keep up. \"If my flow is goin', I keep on until I peak,\" he said. The flow went so well, Wonder released 21 songs, packaged as a double album and a bonus EP. The highlights are the joyful \"Isn't She Lovely\" and \"Sir Duke,\" but Wonder also displays his mastery of funk, jazz, Afrobeat and even a string-quartet minuet. Nineteen years later, Coolio turned the haunting groove of \"Pastime Paradise\" into the Number One single \"Gangsta's Paradise,\" just one example of Life's vast influence on decades of pop."
  },
  {
    "title": "Beggars Banquet",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-rolling-stones-beggars-banquet-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ee1d802faf428f24bfdcf23cead8f5c9797f6ab4.JPG",
    "artist": "The Rolling Stones",
    "rank": 58,
    "label": "ABKCO",
    "year": 1968,
    "summary": "\"When we had been in the States between 1964 and '66, I had gathered together this enormous collection of records, but I never had any time to listen to them,\" Keith Richards recalled. \"In late 1966 and '67, I unwrapped them and actually played them.\" After the wayward psychedelia of 1967's Their Satanic Majesties Request, and with guitarist Brian Jones largely AWOL, Richards' record collection led the Rolling Stones back to their version of America: country music on \"Dear Doctor,\" the blues on \"Prodigal Son\" and urban riots on \"Street Fighting Man.\" And \"Sympathy for the Devil\" is an anthem for the darkness in every human heart - in other words, just one more example of the Stones getting back to basics."
  },
  {
    "title": "Chronicle Vol. 1",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/creedence-clearwater-revival-chronicle-vol-1-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c305a673692a96976fce8b404c1bf141b7db621e.jpg",
    "artist": "Creedence Clearwater Revival",
    "rank": 59,
    "label": "Fantasy",
    "year": 1976,
    "summary": "Between 1968 and early 1972, CCR rolled out 13 Top 40 songs, which still stand as the most impressive run of hits made by an American band. Former Army reservist and Little Richard fan John Fogerty was the dance-band populist on the San Francisco ballroom scene, writing concise, catchy songs like \"Down on the Corner\" and \"Proud Mary\" that fused R&B boogie with longhaired West Coast chooglin'. He also tapped into the spirit of the times, tackling the Vietnam War on \"Who'll Stop the Rain\" and class politics on \"Fortunate Son.\" This compilation demonstrates over and over how much American possibility you can pack into two-minute blasts of car-radio heaven."
  },
  {
    "title": "Trout Mask Replica",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/captain-beefheart-and-his-magic-band-trout-mask-replica-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/a4b6f5b0e8e36b7180fdea278755bb4099099d14.JPG",
    "artist": "Captain Beefheart and His Magic Band",
    "rank": 60,
    "label": "Straight",
    "year": 1969,
    "summary": "On first listen, Trout Mask Replica sounds like a wild, incomprehensible rampage through the blues. Don Van Vliet (a.k.a. Captain Beefheart) growls, rants and recites poetry over chaotic guitar licks. But every note was precisely planned in advance - to construct the songs, the Magic Band rehearsed 12 hours a day for months on end in a house with the windows blacked out. (Producer and longtime friend Frank Zappa was then able to record most of the album in less than five hours.) The avant-garde howl of tracks such as \"Ella Guru\" and \"My Human Gets Me Blues\" have inspired modern primitives from Tom Waits to PJ Harvey."
  },
  {
    "title": "Greatest Hits",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/sly-and-the-family-stone-greatest-hits-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/76aa8b1a1fec965275cf1bf6576217d5716f6f0a.JPG",
    "artist": "Sly and the Family Stone",
    "rank": 61,
    "label": "Epic",
    "year": 1970,
    "summary": "Sly and the Family Stone created a musical utopia: an interracial group of men and women who blended funk, rock and positive vibes. Sly Stone, the Family mastermind, was one of the Sixties' most ambitious artists, mixing up the hardest funk beats with hippie psychedelia in hits such as \"Thank You (Falettinme Be Mice Elf Agin).\" Greatest Hits ranges from gospel-style ballads (\"Everybody Is a Star\") to rump shakers (\"Everyday People\") to soulful bubblegum (\"Hot Fun in the Summertime\"). Stone discovered his utopia had a ghetto, and he brilliantly tore the whole thing down on 1971's There's a Riot Goin' On [see No. 99]. But nothing can negate the joy of this music."
  },
  {
    "title": "Appetite for Destruction",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/guns-n-roses-appetite-for-destruction-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/4e6da25216527bf930346f52271b6eb2122a716d.JPG",
    "artist": "Guns N' Roses",
    "rank": 62,
    "label": "Geffen",
    "year": 1987,
    "summary": "The biggest-selling debut album of all time, Appetite for Destruction, features a lot more than the yowl of Indiana-bred W. Axl Rose, the only member still in Guns N' Roses. Guitarist Slash gave the band blues emotion and punk energy, while the rhythm section brought the funk on hits such as \"Welcome to the Jungle\" and \"Mr. Brownstone.\" When all the elements came together, as in the final two minutes of \"Paradise City,\" G N' R left all other Eighties metal bands looking like poodle-haired pretenders, and they knew it, too. \"A lot of rock bands are too fucking wimpy to have any sentiment or any emotion,\" Rose said. \"Unless they're in pain.\""
  },
  {
    "title": "Achtung Baby",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/u2-achtung-baby-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/05c62e826eb9c0ef8fbf3e4e2d807a355efb0c94.JPG",
    "artist": "U2",
    "rank": 63,
    "label": "Island",
    "year": 1991,
    "summary": "After fostering a solemn public image for years, U2 loosened up on Achtung Baby, a prescient mix of sleek rock and pulsing Euro grooves recorded in Berlin and Dublin with Brian Eno and Daniel Lanois. They no longer sounded like young men sure of the answers; now they were full of doubt and longing. \"It's a con, in a way,\" Bono told Rolling Stone about the album in 1992. \"We call it Achtung Baby, grinning up our sleeves in all the photography. But it's probably the heaviest record we've ever made.\" \"One\" may be their most gorgeous song, but it's a dark ballad about a relationship in peril and the struggle to keep it together. Yet the emotional turmoil made U2 sound more human than ever."
  },
  {
    "title": "Sticky Fingers",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-rolling-stones-sticky-fingers-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/631aebeb7535cea014244f29a3852307841c56bb.JPG",
    "artist": "The Rolling Stones",
    "rank": 64,
    "label": "Rolling Stones Records",
    "year": 1971,
    "summary": "Drummer Charlie Watts remembered the origin of Sticky Fingers as the songs Mick Jagger wrote while filming the movie Ned Kelly in Australia. \"Mick started playing the guitar a lot,\" Watts said. \"He plays very strange rhythm guitar... very much how Brazilian guitarists play, on the upbeat. It is very much like the guitar on a James Brown track - for a drummer, it's great to play with.\" New guitarist Mick Taylor stretched out the Stones' sound in \"Sway,\" \"Can't You Hear Me Knocking\" and \"Moonlight Mile.\" But \"Brown Sugar\" is a classic Stones stomp, and two of the best cuts are country songs: one forlorn (\"Wild Horses\") and one funny (\"Dead Flowers\")."
  },
  {
    "title": "Back to Mono (1958-1969)",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/phil-spector-back-to-mono-1958-1969-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/e2ebe7062791aa4ff3e0c5d93bf32d2d2a588f40.JPG",
    "artist": "Phil Spector",
    "rank": 65,
    "label": "ABKCO",
    "year": 1991,
    "summary": "When the Righteous Brothers' Bobby Hatfield first heard their \"You've Lost That Lovin' Feelin',\" with partner Bill Medley's extended solo, he asked, \"But what do I do while he's singing the whole first verse?\" Producer Phil Spector replied, \"You can go directly to the bank!\" Spector invented the idea of the rock producer as artist. He built his Wall of Sound out of hand claps, strings, massive overdubs and mountains of percussion, making some of the most frenzied, dramatic teenage-lust pop ever heard. This box has hits such as the Ronettes' \"Be My Baby,\" Darlene Love's \"A Fine, Fine Boy\" and the Crystals' \"Da Doo Ron Ron,\" one of Spector's \"little symphonies for the kids.\""
  },
  {
    "title": "Moondance",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/van-morrison-moondance-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/62fc0b0d65ef7c2f2a9a37cb66f1051e927bcd50.JPG",
    "artist": "Van Morrison",
    "rank": 66,
    "label": "Warner Bros.",
    "year": 1970,
    "summary": "\"That was the type of band I dig,\" Van Morrison said of the Moondance sessions. \"Two horns and a rhythm section - they're the type of bands that I like best.\" Morrison took that soul-band lineup and blended it with jazz, blues, poetry and vivid memories of his Irish childhood, until songs such as \"And It Stoned Me,\" \"Crazy Love\" and \"Caravan\" felt like lucid dreams - it's some of the most romantic music ever made. In the lushly swinging title hit, Morrison turns the words over and over in his mouth, not scatting so much as searching for a new language of desire. The title of the album's transporting centerpiece, \"Into the Mystic,\" serves as an apt summary: This is an album of late-night revelry and ecstatic visions."
  },
  {
    "title": "Kid A",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/radiohead-kid-a-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/dc5847d14a98590646f38ff1bb045fe6e9523850.JPG",
    "artist": "Radiohead",
    "rank": 67,
    "label": "Capitol",
    "year": 2000,
    "summary": "\"Kid A is like getting a massive eraser out and starting again,\" Thom Yorke said in October 2000, the week this album became the British band's first Number One record in America. \"I find it difficult to think of the path we've chosen as 'rock music.'\" In fact, Kid A remains the most groundbreaking rock album of the '00s - Radiohead rebuilt, with a new set of bsaics and a bleak but potent humanity. Just when the Nineties alt-rock heroes seemed destined to become the next U2, they made a fractured, twitchy anti-opus. Despite esoteric nods to electronica (\"Idioteque\") and free jazz (\"The National Anthem\"), they morphed alien sounds into a surprisingly accessible elegy to tenderness - and had a hit anyway."
  },
  {
    "title": "Off the Wall",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/michael-jackson-off-the-wall-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/8c1e5b0582a5b46fc80e0db97c87f48661e672e8.JPG",
    "artist": "Michael Jackson",
    "rank": 68,
    "label": "Epic",
    "year": 1979,
    "summary": "\"The ballads were what made Off the Wall a Michael Jackson album,\" Jackson remembered of his big solo splash, which spun off four Top 10 hits and eclipsed the success of the Jackson 5. \"I'd done ballads with [my] brothers, but they had never been too enthusiastic about them and did them more as a concession to me than anything else.\" In \"She's Out of My Life,\" you can hear Jackson actually break down and cry in the studio. But the unstoppable dance tracks on Off the Wall - sculpted by Jackson and producer Quincy Jones - remain more or less perfect examples of why disco didn't suck. \"Don't Stop 'Til You Get Enough,\" \"Rock With You\" and \"Burn This Disco Out\" still get the party started today."
  },
  {
    "title": "Led Zeppelin IV",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/led-zeppelin-led-zeppelin-iv-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c4082fd6526f33db9b4e851a72d96784119fd52c.JPG",
    "artist": "Led Zeppelin",
    "rank": 69,
    "label": "Atlantic",
    "year": 1971,
    "summary": "\"I put a lot of work into my lyrics,\" Robert Plant told Rolling Stone in 1975. \"Not all my stuff is meant to be scrutinized, though. Things like 'Black Dog' are blatant let's-do-it-in-the-bath-type things, but they make their point just the same.\" On their towering fourth album, Led Zeppelin match the raunch of \"Black Dog\" with Plant's most poetic lyrics for the inescapable epic ballad \"Stairway to Heaven,\" while guitarist Jimmy Page veers from the blues apocalypse of \"When the Levee Breaks\" to the torrid Little Richard tribute \"Rock & Roll\" to the mandolin-driven \"Battle of Evermore.\" (\"It sounded like a dance-around-the-maypole number,\" Page later confessed.) Maypole or no, IV was the peak of Seventies hard rock."
  },
  {
    "title": "The Stranger",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/billy-joel-the-stranger-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ccdc7ef4844eea964e02ab50740e5cd4301a0ae9.JPG",
    "artist": "Billy Joel",
    "rank": 70,
    "label": "Columbia",
    "year": 1977,
    "summary": "Billy Joel had been on the verge throughout the mid-Seventies. But his fifth album had the recipe for success: a bottle of red, a bottle of white and a sharp eye for the local color of New York street life. The piano man hones his storytelling gifts with a Scorsese-style sense of humor and compassion, whether he's singing about a down-and-out Little Italy hustler in \"Movin' Out (Anthony's Song),\" the femme fatale in \"She's Always a Woman to Me\" or the doomed Long Island greaser couple Brenda and Eddie in \"Scenes From an Italian Restaurant.\" Meanwhile, he hit the pop charts with the Grammy-winning \"Just the Way You Are\" (written for his first wife and manager, Elizabeth), which became a wedding-band standard."
  },
  {
    "title": "Graceland",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/paul-simon-graceland-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/2dabb95cffdc9f2d4e37b3157cec36e34b382598.JPG",
    "artist": "Paul Simon",
    "rank": 71,
    "label": "Warner Bros.",
    "year": 1986,
    "summary": "Frustrated by the experience of writing good songs that didn't come to life in the studio, Paul Simon set out \"to make really good tracks,\" as he later put it. \"I thought, 'I have enough songwriting technique that I can reverse this process and write the song after the tracks are made.'\" Simon risked severe criticism by going to South Africa (then under apartheid) and working with the best musicians from the black townships. With the fluid energy and expertise of guitarist Ray Phiri and the vocal troupe Ladysmith Black Mambazo, Simon created an album about isolation and redemption that transcended \"world music\" to become the whole world's soundtrack. The bright grooves backed some of the sharpest, funniest lyrics of his career."
  },
  {
    "title": "Superfly",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/curtis-mayfield-superfly-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c8bf4bb3309cfafe5b4bddece81a591e52fa2857.JPG",
    "artist": "Curtis Mayfield",
    "rank": 72,
    "label": "Curtom",
    "year": 1972,
    "summary": "Isaac Hayes' Shaft came first - but that record had one great single and a lot of instrumental filler. It was Curtis Mayfield who made a blaxploitation-soundtrack album that packed more drama than the movie it accompanied. Musically, Superfly is astonishing, marrying lush string parts to deep bass grooves, with lots of wah-wah guitar. On top, Mayfield sings in his worldly-wise falsetto, narrating the bleak ghetto tales of \"Pusherman\" and \"Freddie's Dead,\" telling hard truths about the drug trade and black life in the 1970s; it was Marvin Gaye's What's Going On at street level. \"I don't take credit for everything I write,\" Mayfield said. \"I only look upon my writings as interpretations of how the majority of people around me feel.\""
  },
  {
    "title": "Physical Graffiti",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/led-zeppelin-physical-graffiti-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/53a00c2335b36eb447e75ae2387e96b0e6ba6a20.JPG",
    "artist": "Led Zeppelin",
    "rank": 73,
    "label": "Swan Song",
    "year": 1975,
    "summary": "\"Let's put it this way: I had a sitar before George Harrison,\" said Jimmy Page, explaining his longtime love for Indian music. Zep's frontman shared that affinity: In 1972, Robert Plant and Page journeyed to Bombay to make experimental recordings with Indian studio musicians and perform in an underground disco. Physical Graffiti is the ultimate in Led Zeppelin's attempts to fuse East and West, exploring the Arabic and Indian sonorities of \"Kashmir\" and \"In the Light.\" It's Zeppelin's most eclectic album, featuring down-and-dirty blues (\"Black Country Woman,\" \"Boogie With Stu\"), pop balladry (\"Down by the Seaside\") and the 11-minute \"In My Time of Dying.\" An excessive album from the group that all but invented excess."
  },
  {
    "title": "After the Gold Rush",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/neil-young-after-the-gold-rush-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/7e03f32e7c9594a706f545a9c8cdd53e260bcafd.JPG",
    "artist": "Neil Young",
    "rank": 74,
    "label": "Reprise",
    "year": 1970,
    "summary": "For his third album, Neil Young fired Crazy Horse (the first of many times he would do so), picked up an acoustic guitar and headed to his basement. He installed recording equipment in the cellar of his Topanga Canyon home in Los Angeles, leaving room for only three or four people. There, Young made an album of heartbreaking ballads such as \"Tell Me Why\" and \"Don't Let It Bring You Down.\" The music is gentle, but never smooth (check the bracing \"Southern Man\"). Nils Lofgren, then a 17-year-old hotshot guitarist, squeezed into the sessions, but Young assigned him to the piano, an instrument he had never played in his life; it was a characteristically contrary move that worked out beautifully."
  },
  {
    "title": "Star Time",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/james-brown-star-time-20120525",
    "cover": "http://assets.rollingstone.com/assets/images/list/a7b2521a515dc36ea56d181cada01ce0a27bbbb4.jpg",
    "artist": "James Brown",
    "rank": 75,
    "label": "Polydor",
    "year": 1991,
    "summary": "So great is James Brown's impact that even the four-CD Star Time isn't quite comprehensive - between 1956 and 1988, Brown placed an astounding 100 singles on the R&B Top 40 charts. But every phase of his career is well represented here: the pleading, straight-up soul of \"Please, Please, Please\"; his instantaneous reinvention of R&B with \"Papa's Got a Brand New Bag,\" where the rhythm takes over and melody is subsumed within the groove; his spokesmanship for the civil rights movement in \"Say It Loud - I'm Black and I'm Proud (Pt. 1)\"; his founding document of Seventies funk, \"Get Up (I Feel Like Sex Being a) Sex Machine\"; and his blueprint for hip-hop in \"Funky Drummer.\" At 71 tracks, it never gets close to running out of soul power."
  },
  {
    "title": "Purple Rain",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/prince-and-the-revolution-purple-rain-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/2dae4591d79f7c29a18496926740d720908e3127.JPG",
    "artist": "Prince and the Revolution",
    "rank": 76,
    "label": "Warner Bros.",
    "year": 1984,
    "summary": "The blockbuster soundtrack to Prince's semiautobiographical movie was raunchy enough to inspire the formation of the censorship watchdog group Parents' Music Resource Center. It also showcased Prince's abilities as a guitarist, especially on \"Let's Go Crazy.\" But at heart, Purple Rain is defined by its brilliant idiosyncrasies. Its breakthrough hit, \"When Doves Cry,\" has no bass track (looking for a different sound, Prince removed it). According to keyboardist Dr. Fink, the title track was inspired by Bob Seger - when Prince was touring behind 1999 [see No. 163], Seger was playing many of the same markets. Prince didn't understand his appeal but decided to try a ballad in the Seger mode."
  },
  {
    "title": "Back in Black",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/ac-dc-back-in-black-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/06d9970eddbfbcae66ad664a73c6d52862d91d7c.JPG",
    "artist": "AC/DC",
    "rank": 77,
    "label": "Atlantic",
    "year": 1980,
    "summary": "In the middle of album rehearsals, singer Bon Scott went on a drinking spree; he choked on his own vomit and was found dead in the back seat of a car. After two days of mourning, guitarist Malcolm Young thought, \"Well, fuck this, I'm not gonna sit around mopin' all fuckin' year.\" He called his brother, guitarist Angus Young, and they went back to work with replacement vocalist Brian Johnson and savvy producer Mutt Lange. The resulting album has the relentless logic of a sledgehammer. Back in Black might be the purest distillation of hard rock ever: The title track, \"Hells Bells\" and the primo dance-metal banger \"You Shook Me All Night Long\" have all become enduring anthems of strutting blues-based guitar heat"
  },
  {
    "title": "Otis Blue",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/otis-redding-otis-blue-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/93f4b651ac369f0603463d0c1a539ab7ccd05241.JPG",
    "artist": "Otis Redding",
    "rank": 78,
    "label": "Volt",
    "year": 1965,
    "summary": "Otis Redding's third album includes covers of three songs by Sam Cooke, Redding's idol, who had died the previous December. Their styles were different: Cooke, smooth and sure; Redding, raw and pleading. But Redding's versions of \"Shake\" and \"A Change Is Gonna Come\" show how Cooke's sound and message helped shape Redding's Southern soul, heard here in his originals \"Respect\" and \"I've Been Loving You Too Long\" and in a cover of the Rolling Stones' \"(I Can't Get No) Satisfaction,\" which was itself inspired by the Stax/Volt sound. \"I use a lot of words different than the Stones' version,\" Redding noted. \"That's because I made them up.\" Two years later, his life would also be tragically cut short."
  },
  {
    "title": "Led Zeppelin II",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/led-zeppelin-led-zeppelin-ii-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/cb5312fe6a5648ee4441e580ad904c4600a8d45e.JPG",
    "artist": "Led Zeppelin",
    "rank": 79,
    "label": "Atlantic",
    "year": 1969,
    "summary": "This album - recorded on the fly while the band was touring - opens with one of the most exhilarating guitar riffs in rock & roll: Jimmy Page's searing stutter in \"Whole Lotta Love.\" As Page told Rolling Stone, \"On the second LP, you can hear the real group identity coming together,\" by which he meant the unified might of his own white-blues devilry, John Bonham's hands-of-God drumming, Robert Plant's misty-mountain howl and John Paul Jones' firm bass and keyboard colors. Other great reasons to bang your head: \"The Lemon Song,\" \"Heartbreaker\" and \"Ramble On,\" where Plant meets a girl in the darkest depths of Mordor and singlehandedly engenders a sales spike for J.R.R. Tolkien books."
  },
  {
    "title": "Imagine",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/john-lennon-imagine-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/0b79ac312d1402b86d803ab464e58c456277e9fc.JPG",
    "artist": "John Lennon",
    "rank": 80,
    "label": "Apple",
    "year": 1971,
    "summary": "After the primal-scream therapy of Plastic Ono Band, John Lennon softened up and opened up on his second solo album. There is still the stinging \"Gimme Some Truth\" and Lennon's evisceration of Paul McCartney, \"How Do You Sleep?\" - both featuring George Harrison on guitar. But there is also the aching soul of \"Jealous Guy\" and the irresistible vulnerability of \"Oh Yoko!\" Imagine is self-consciously luminescent, pointedly embraceable, the sound of cynicism melting. Lennon said of the title track, \"Anti-religious, anti-nationalistic, anticonventional, anti-capitalistic, but because it is sugarcoated it is accepted... Now I understand what you have to do. Put your political message across with a little honey.\""
  },
  {
    "title": "The Clash",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-clash-the-clash-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ce67282f913d3d9bc2433f7084a5f5d22bc1f38a.JPG",
    "artist": "The Clash",
    "rank": 81,
    "label": "Epic",
    "year": 1979,
    "summary": "\"I haven't got any illusions about anything,\" Joe Strummer said. \"Having said that, I still want to try to change things.\" That youthful ambition bursts through the Clash's debut, a machine-gun blast of songs about unemployment (\"Career Opportunities\"), race (\"White Riot\"), the Clash themselves (\"Clash City Rockers\") and the sick English music industry (\"[White Man] In Hammersmith Palais\"). Most of the guitar was played by Mick Jones, because Strummer considered studio technique insufficiently punk. The American release was delayed two years and replaced some of the U.K. tracks with recent singles, including \"Complete Control\" - a complaint about exactly that sort of record-company shenanigans."
  },
  {
    "title": "Harvest",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/neil-young-harvest-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ec319af29f5efd5d20d9633f0c535e0151e59a42.JPG",
    "artist": "Neil Young",
    "rank": 82,
    "label": "Reprise",
    "year": 1972,
    "summary": "Harvest yielded Neil Young's only Number One hit, \"Heart of Gold,\" and helped set the stage for the Seventies soft-rock explosion - both James Taylor and Linda Ronstadt sing on the album. Along with Young, they were in Nashville to appear on Johnny Cash's ABC-TV variety show the first weekend that Harvest was being cut with an odd group of accomplished session musicians that included bassist Tim Drummond, who had played with James Brown (Young's bandmates Crosby, Stills and Nash also appeared on the album). The sound, on tracks like \"Old Man\" and \"The Needle and the Damage Done,\" was Americana (steel guitar, slide guitar, banjo) stripped down and rebuilt with every jagged edge exposed."
  },
  {
    "title": "Axis: Bold as Love",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-jimi-hendrix-experience-axis-bold-as-love-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/8bd73526cc9968e358761e26e4fe42c641910802.JPG",
    "artist": "The Jimi Hendrix Experience",
    "rank": 83,
    "label": "Reprise",
    "year": 1968,
    "summary": "Jimi Hendrix's first album remade rock & roll with guitar magic that no one had ever dreamed of; his second album had even more sorcery. It started with some musings on extraterrestrial life, then got really far-out: jazzy drumming, funky balladry, liquid guitar solos, dragonfly heavy metal and the immortal stoner's maxim from \"If 6 Was 9\": \"I'm the one who's gonna have to die when it's time for me to die, so let me live my life the way I want to.\" All over the album, Hendrix was inventing new ways to make the electric guitar roar, sing, talk, shriek, flutter and fly. And with the delicate \"Little Wing,\" he delivered one of rock's most cryptic and bewitching love songs."
  },
  {
    "title": "I Never Loved a Man the Way I Loved You",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/aretha-franklin-i-never-loved-a-man-the-way-i-loved-you-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/2ae6552932d20ce4bdc5c361c7f57797c8ba2217.JPG",
    "artist": "Aretha Franklin",
    "rank": 84,
    "label": "Atlantic",
    "year": 1967,
    "summary": "Aretha Franklin's Atlantic debut is the place where gospel collided with R&B and rock & roll to make soul music as we know it today. The Detroitborn preacher's daughter was about $80,000 in debt to her previous label, Columbia - where she had recorded a series of somewhat tame early-Sixties albums - when Atlantic producer Jerry Wexler signed her in 1966. \"I took her to church,\" Wexler said, \"sat her down at the piano, and let her be herself.\" She immediately cut the album's title hit, a slow fire of ferocious sexuality, while her storefrontchurch cover of Otis Redding's \"Respect\" - Franklin's first Number One pop single - became the marching song for the women's and civil rights movements."
  },
  {
    "title": "Lady Soul",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/aretha-franklin-lady-soul-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/434330e80536d2bb420ca5ff91a6ed24651f0e69.JPG",
    "artist": "Aretha Franklin",
    "rank": 85,
    "label": "Atlantic",
    "year": 1968,
    "summary": "Aretha Franklin's third Atlantic album in less than two years is another classic, with \"(You Make Me Feel) Like a Natural Woman,\" \"Ain't No Way\" and a slinky version of the Rascals' \"Groovin'.\" It was released in a year of triumph and turbulence for Franklin: Although she made the cover of Time, the magazine reported details of her rocky marriage to Ted White, then her manager. But Franklin channeled that frenzy into performances of funky pride and magisterial hurt. Among the best: the grand-prayer treatment of Curtis Mayfield's \"People Get Ready,\" the revved-up longing of \"Since You've Been Gone (Sweet Sweet Baby)\" and her explosive anguish on the hit cover of Don Covay's \"Chain of Fools.\""
  },
  {
    "title": "Born in the U.S.A.",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bruce-springsteen-born-in-the-u-s-a-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/942105f84afcbf3168dd9c0ad83f5130b368af82.JPG",
    "artist": "Bruce Springsteen",
    "rank": 86,
    "label": "Columbia",
    "year": 1984,
    "summary": "Bruce Springsteen wrote many of these songs in a fit of inspiration that also gave birth to the harrowing Nebraska [see No. 226]. \"Particularly on the first side, [Born] is actually written very much like Nebraska,\" he said. \"The characters and the stories, the style of writing - except it's just in the rock-band setting.\" It was a crucial difference: The E Street Band put so much punch into the ironic title song that millions misheard it as mere flag-waving instead (conservative pundit George Will wrote a rhapsodic column titled \"A Yankee Doodle Springsteen\"). The immortal force of the album is in Springsteen's frank mix of soaring optimism and the feeling of, as he put it, being \"handcuffed to the bumper of a state trooper's Ford.\""
  },
  {
    "title": "The Wall",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/pink-floyd-the-wall-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/f4449616e18127542ce4b5534585068d30a10201.JPG",
    "artist": "Pink Floyd",
    "rank": 87,
    "label": "Columbia",
    "year": 1979,
    "summary": "Pink Floyd's most elaborately theatrical album was inspired by their own success: the alienating enormity of their tours after The Dark Side of the Moon [see No. 43]. As the band played arenas in 1977, bassistlyricist Roger Waters first hit upon the wall as a metaphor for isolation and rebellion. He finished a demo of the work by July 1978; the double album then took the band a year to make. Rock's ultimate self-pity opera, The Wall is also hypnotic in its indulgence: the totalitarian thunder of \"In the Flesh?,\" the suicidal languor of \"Comfortably Numb,\" the Brechtian drama of \"The Trial\" and the anti-institutional spleen of the album's unshakable disco hit, \"Another Brick in the Wall, Pt. 2.\" Rock-star hubris has never been more electrifying."
  },
  {
    "title": "At Folsom Prison",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/johnny-cash-at-folsom-prison-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/af22084dc4088905a4eb9afab73bb7efc9ce780b.JPG",
    "artist": "Johnny Cash",
    "rank": 88,
    "label": "Columbia",
    "year": 1968,
    "summary": "By the late Sixties, Johnny Cash was ignored by country radio and struggling for a comeback. At Folsom Prison was the gold-selling shot in the arm that revived his career. A year later, he was writing liner notes for Bob Dylan's countrified Nashville Skyline and logging four weeks at Number One with his second prison album, At San Quentin. But At Folsom Prison is essential Cash. Backed by his tough touring band, including fellow Sun Records alum Carl Perkins on guitar, Cash guffaws his way through \"Cocaine Blues,\" \"25 Minutes to Go\" (a countdown to an execution) and \"Folsom Prison Blues,\" with its line about shooting a man just to watch him die. The 2,000 inmates in attendance roar their approval."
  },
  {
    "title": "Dusty in Memphis",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/dusty-springfield-dusty-in-memphis-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/d40f4d4da2d9d7a419717c8344f1444281c98dc5.JPG",
    "artist": "Dusty Springfield",
    "rank": 89,
    "label": "Atlantic",
    "year": 1969,
    "summary": "London-born Dusty Springfield was a great soul singer hidden inside a white British pop queen - racking up Motown-style hits such as \"I Only Want to Be With You\" - when Atlantic producer Jerry Wexler brought her way down South, to Memphis, to make this album. She was so intimidated by the idea of recording with session guys from her favorite Aretha Franklin and Wilson Pickett hits that she never actually managed to sing a note there (\"I always wanted to be Aretha,\" she recalled years after). Her vocals were overdubbed later, when the sessions moved to New York. But the result was blazing soul and sexual honesty (\"Breakfast in Bed,\" \"Son of a Preacher Man\") that transcended both race and geography."
  },
  {
    "title": "Talking Book",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/stevie-wonder-talking-book-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/6bec8d7a22812f54cfae333ed7d1f18228f5f519.JPG",
    "artist": "Stevie Wonder",
    "rank": 90,
    "label": "Tamla",
    "year": 1972,
    "summary": "\"I don't think you know where I'm coming from,\" Stevie Wonder warned Motown executives in 1971. \"I don't think you can understand it.\" Indeed, the two albums Wonder released in 1972 - Music of My Mind and Talking Book - rewrote the rules of the Motown hit factory. Talking Book was full of introspection and social commentary, with Wonder producing, writing and playing most of the instruments himself. But it's still radiant pop. \"Superstition\" and \"You Are the Sunshine of My Life\" were Number One singles; \"Big Brother\" is political consciousness draped in a light melody: \"You've killed all our leaders/I don't even have to do nothin' to you/You'll cause your own country to fall.\""
  },
  {
    "title": "Goodbye Yellow Brick Road",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/elton-john-goodbye-yellow-brick-road-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/62a6bb35e40a1315bcdb5a541492bc93fc3a7cfb.JPG",
    "artist": "Elton John",
    "rank": 91,
    "label": "MCA",
    "year": 1973,
    "summary": "Elton John compared this double album to the Beatles' White Album, and why not? By this point he was the most consistent hitmaker since the Fab Four, and soon enough he would be recording with John Lennon. Everything about Goodbye Yellow Brick Road is supersonically huge, from the Wagnerian-operalike combo of \"Funeral for a Friend\" and \"Love Lies Bleeding\" to the electric boots and mohair suit of \"Bennie and the Jets.\" \"Saturday Night's Alright for Fighting\" is strutting rock & roll, \"Candle in the Wind\" pays tribute to Marilyn Monroe, and the title track harnesses the fantastic imagery of glam to a Gershwin-sweet melody."
  },
  {
    "title": "20 Golden Greats",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/buddy-holly-20-golden-greats-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/a8a3f78f4dc628cd1451f8c5e38979d097e59fb5.JPG",
    "artist": "Buddy Holly",
    "rank": 92,
    "label": "MCA",
    "year": 1978,
    "summary": "The country-weened Texan put his trademark hiccup on springy rockabilly, tight rave-ups and orchestral ballads - an eclecticism that had a huge impact on the future Beatles. \"Rave On,\" \"Peggy Sue\" and \"Not Fade Away\" made Holly one of rock's first great singer-songwriters."
  },
  {
    "title": "Sign 'o' the Times",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/prince-sign-o-the-times-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/ffe7f8ac37e7fd481d268c3109ce8ade62f4e1d4.JPG",
    "artist": "Prince",
    "rank": 93,
    "label": "Paisley Park",
    "year": 1987,
    "summary": "The most expansive R&B record of the Eighties is best known for the apocalyptic title track, the funk banger \"Housequake\" and the gorgeous \"If I Was Your Girlfriend.\" Yet the simplest moments are unforgettable: the guitar plea \"The Cross\" and the Stax revamp on \"Slow Love.\""
  },
  {
    "title": "40 Greatest Hits",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/hank-williams-40-greatest-hits-20120525",
    "cover": "http://assets.rollingstone.com/assets/images/list/9a14d7c339541e7fa0f9218a21a873e83ae3fece.jpg",
    "artist": "Hank Williams",
    "rank": 94,
    "label": "Polydor",
    "year": 1978,
    "summary": "When he died on New Year's Day 1953, at age 29, in the back of a Cadillac, Williams was the biggest star in country music. His vocal twang, lovesick ballads and long-gone-daddy romps left their stamp on decades of rock & roll - from Elvis to Dylan to the Replacements to Beck. "
  },
  {
    "title": "Bitches Brew",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/miles-davis-bitches-brew-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/1aa850852a50d38f55ae0b0c688b2d4f4403c70b.JPG",
    "artist": "Miles Davis",
    "rank": 95,
    "label": "Columbia",
    "year": 1970,
    "summary": "Davis wanted to connect his music to the audience of Jimi Hendrix and Sly Stone. The result was this double album of jazz-rock fusion, cut with an electric orchestra that included saxophonist Wayne Shorter and guitarist John McLaughlin. It’s full of visceral thrills and the brooding darkness Davis brought to everything he touched."
  },
  {
    "title": "Tommy",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-who-tommy-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/70195a5c116bff799265d42788bc73ca1fbfe622.JPG",
    "artist": "The Who",
    "rank": 96,
    "label": "Decca",
    "year": 1969,
    "summary": "\"Rock opera\" is one way to describe this exploration of childhood trauma, sexual abuse, repression and spiritual release. Here's another way: the slash and thunder of \"My Generation\" blown wide open. Driven by Keith Moon's hellbent drumming, the Who surge and shine, igniting the drama in Pete Townshend's melodies."
  },
  {
    "title": "The Freewheelin' Bob Dylan",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/bob-dylan-the-freewheelin-bob-dylan-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/8e33d65973df4e70e8fbf8bd0dbdaace59293e68.JPG",
    "artist": "Bob Dylan",
    "rank": 97,
    "label": "Columbia",
    "year": 1963,
    "summary": "On Dylan's second album, the poetry and articulate fury of his lyrics and the simple, compelling melodies in songs like \"Masters of War\" and \"Blowin' in the Wind\" transformed American songwriting. Not bad for a guy who had just turned 22."
  },
  {
    "title": "This Year's Model",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/elvis-costello-this-years-model-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/b1c40d0c34e89fa14f600ba775f425e52bd08224.JPG",
    "artist": "Elvis Costello",
    "rank": 98,
    "label": "Columbia",
    "year": 1978,
    "summary": "Costello's second album, and his first with the Attractions, is his most \"punk\" - not in any I-hate-the-cops sense but in his emotionally explosive writing and his backing band's vicious gallop. \"Radio, Radio,\" the broadside against vanilla-pop broadcasting, distills his righteous indignation: Elvis versus the world. And Elvis wins."
  },
  {
    "title": "There's a Riot Goin' On",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/sly-and-the-family-stone-theres-a-riot-goin-on-20120524",
    "cover": "http://assets.rollingstone.com/assets/images/list/c11fbdd3d1d1efe83f84ba5ea1ae7ceb24d1928d.JPG",
    "artist": "Sly and the Family Stone",
    "rank": 99,
    "label": "Epic",
    "year": 1971,
    "summary": "Sly's 1969 album Stand! burst with optimism. But he met the Seventies with implosive, numbing, darkly self-referential funk that was deeply compelling in its anguish over dreams deferred."
  },
  {
    "title": "Odessey and Oracle",
    "url": "http://www.rollingstone.com/music/lists/500-greatest-albums-of-all-time-20120531/the-zombies-odessey-and-oracle-20120525",
    "cover": "http://assets.rollingstone.com/assets/images/list/4e049f07b395009537a0950b9ad5c9463042a78f.jpg",
    "artist": "The Zombies",
    "rank": 100,
    "label": "Columbia",
    "year": 1969,
    "summary": "Odessey and Oracle wasn't released in the U.S. until 1969 - two years after it was recorded and the Zombies had broken up. But its baroque psychedelic-pop arrangements still felt fresh - combining the adventure of Sgt. Pepper with the concision of British Invasion pop. And \"Time of the Season\" went on to become a Number Three hit."
  }
]
